In [1]:
import numpy as np
import pandas as pd

In [4]:
dataframe = pd.DataFrame({'col1':[1,2,3],
                            'col2': [2,4,2],
                             'col3': ['abc', 'def','ghi']})
dataframe

   col1  col2 col3
0     1     2  abc
1     2     4  def
2     3     2  ghi

In [5]:
dataframe.head()

   col1  col2 col3
0     1     2  abc
1     2     4  def
2     3     2  ghi

In [6]:
#finding unique value in dataframe
#method:
#1 unique()
#2 check the length of array; pandas has built in method i.e nunique
#3 value count: value_counts()

In [11]:
dataframe['col1'].unique() #returns actual unique value

array([1, 2, 3], dtype=int64)

In [10]:
dataframe['col1'].nunique() #returns number of unique values

3

In [12]:
dataframe['col2'].value_counts() # how many times each unique value occured in that column.

2    2
4    1
Name: col2, dtype: int64

In [13]:
#Selecting data

In [14]:
dataframe

   col1  col2 col3
0     1     2  abc
1     2     4  def
2     3     2  ghi

In [15]:
dataframe[dataframe['col1']>2]

   col1  col2 col3
2     3     2  ghi

In [16]:
dataframe['col1']>2

0    False
1    False
2     True
Name: col1, dtype: bool

In [17]:
#combined operations add paranthesis and pipe operator
dataframe[(dataframe['col1']>2) & (dataframe['col2'] == 2)]

   col1  col2 col3
2     3     2  ghi

In [18]:
#Apply method for costume function

In [19]:
def times2(x):
    return x*2

In [20]:
dataframe['col1'].apply(times2)

0    2
1    4
2    6
Name: col1, dtype: int64

In [22]:
dataframe['col3'].apply(len)

0    3
1    3
2    3
Name: col3, dtype: int64

In [23]:
dataframe['col3'].apply(lambda x: x*2)

0    abcabc
1    defdef
2    ghighi
Name: col3, dtype: object

In [24]:
#remove column

In [26]:
dataframe.drop('col1', axis=1)

   col2 col3
0     2  abc
1     4  def
2     2  ghi

In [27]:
dataframe

   col1  col2 col3
0     1     2  abc
1     2     4  def
2     3     2  ghi

In [28]:
dataframe.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [29]:
dataframe.index

RangeIndex(start=0, stop=3, step=1)

In [30]:
#sorting and ordering data columns

In [31]:
dataframe.sort_values('col2') #sort by col2

   col1  col2 col3
0     1     2  abc
2     3     2  ghi
1     2     4  def

In [32]:
dataframe.sort_values( by='col1') #sort by col1

   col1  col2 col3
0     1     2  abc
1     2     4  def
2     3     2  ghi

In [33]:
dataframe.isnull() # False if there's no nulls

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False

In [37]:
data = {'A': ['foo', 'foo', 'foo', 'bar','bar','bar'],
       'B': ['one', 'one', 'two', 'two', 'one', 'one' ],
       'C': ['x', 'y', 'x', 'y','x','y'],
        'D': [1,3,4,5,4,1]}
data

{'A': ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'],
 'B': ['one', 'one', 'two', 'two', 'one', 'one'],
 'C': ['x', 'y', 'x', 'y', 'x', 'y'],
 'D': [1, 3, 4, 5, 4, 1]}

In [38]:
df= pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  4
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [40]:
df.pivot_table

<bound method DataFrame.pivot_table of      A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  4
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1>

In [41]:
df.pivot_table(values='D', index=['A','B'], columns=['C']) #para: value, index, col

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  4.0  NaN